# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X.

n = int(input("Введите количество элементов в массиве N: "))
list_1 = list()
for i in range(n):
    a = int(input())
    list_1.append(a)
print(*list_1)
x = int(input("Введите искомое число X: "))
print (sum([1 for i in list_1 if i == x]))